meshiterro/app/controllers/favorites_controller.rb

SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_image_id", 1], ["created_at", "2020-09-13 07:16:10.557494"], ["updated_at", "2020-09-13 07:16:10.557494"]]
---
  def create
    post_image = PostImage.find(params[:post_image_id])
    favorite = current_user.favorites.new(post_image_id: post_image.id)
    favorite.save

SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."post_image_id" = ? LIMIT ?  [["user_id", 1], ["post_image_id", 1], ["LIMIT", 1]]
---
  def destroy
    post_image = PostImage.find(params[:post_image_id])
    favorite = current_user.favorites.find_by(post_image_id: post_image.id)