meshiterro/app/controllers/post_comments_controller.rb

SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "post_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "a"], ["user_id", 1], ["post_image_id", 1], ["created_at", "2020-09-12 14:47:59.074464"], ["updated_at", "2020-09-12 14:47:59.074464"]]
---
  def create
    post_image = PostImage.find(params[:post_image_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.post_image_id = post_image.id
    comment.save

DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."post_image_id" = ? LIMIT ?  [["id", 1], ["post_image_id", 1], ["LIMIT", 1]]
---
  def destroy
  PostComment.find_by(id: params[:id], post_image_id: params[:post_image_id]).destroy